Catalogs/ВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ВариантыОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлючОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Администратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВариантаОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВариантовОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БыстрыйДоступ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подсистемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подсистема</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предопределенная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсключенияБыстрогоДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

SettingsStorages/ХранилищеВариантовОтчетов/Forms/ВыборВариантаОтчета/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	КлючОбъекта               = Параметры.КлючОбъекта;
	КлючТекущихНастроек       = Параметры.КлючТекущихНастроек;
	СтандартныеНастройки      = Параметры.СтандартныеНастройки;
	ТекущийПользователь       = Параметры.ТекущийПользователь;
	ПоказыватьТолькоИзбранные = Параметры.ПоказыватьТолькоИзбранные;
		
	Если НЕ ЗначениеЗаполнено(ТекущийПользователь) тогда
		ТекущийПользователь           = Пользователи.ТекущийПользователь();
		Параметры.ТекущийПользователь = ТекущийПользователь;
	КонецЕсли;
	
	ЗаполнитьСписокВариантовОтчета();
	
	СтрокиТекВарианта = СписокВариантовОтчета.НайтиСтроки(Новый Структура("КлючВариантаОтчета", КлючТекущихНастроек));
	Если СтрокиТекВарианта.Количество() > 0 тогда
		Элементы.СписокВариантовОтчета.ТекущаяСтрока = СтрокиТекВарианта[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ СписокВариантовОтчета

&НаКлиенте
Процедура СписокВариантовОтчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьИЗакрытьФорму();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Выбрать(Команда)
	ВыбратьИЗакрытьФорму();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьСписокВариантовОтчета(КлючВарианта = Неопределено)
	
	ВариантыОтчета = РеквизитФормыВЗначение("СписокВариантовОтчета");
	ВариантыОтчета.Очистить();
	ВариантыОтчета.Колонки.Добавить("ДатаИспользования");

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Справочник.Наименование КАК Наименование,
	|	Справочник.Ссылка,
	|	Справочник.КлючВарианта,
	|	Справочник.Администратор,
	|	Справочник.Администратор.Наименование КАК АдминистраторПредставление,
	|	ПОДСТРОКА(Справочник.Описание, 0, 1000) КАК Описание
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК Справочник
	|ГДЕ
	|	Справочник.КлючОбъекта = &КлючОбъекта
	|	И Справочник.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";

	Запрос.Параметры.Вставить("КлючОбъекта", КлючОбъекта);
	
 	УстановитьПривилегированныйРежим(истина);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
 	УстановитьПривилегированныйРежим(ложь);

	Пока Выборка.Следующий() Цикл
		СтрокаСписка = ВариантыОтчета.Добавить();
		СтрокаСписка.Наименование       = Выборка.Наименование;
		СтрокаСписка.КлючВариантаОтчета = Выборка.КлючВарианта;
		СтрокаСписка.Ссылка             = Выборка.Ссылка;
		СтрокаСписка.Автор              = Выборка.Администратор;
		СтрокаСписка.АвторПредставление = Выборка.АдминистраторПредставление;
		СтрокаСписка.Описание           = Выборка.Описание;
	КонецЦикла;
	
	ДобавитьВариантыВнешнегоОтчета(КлючОбъекта, ВариантыОтчета);
	
	ЗначениеВРеквизитФормы(ВариантыОтчета, "СписокВариантовОтчета");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВариантыВнешнегоОтчета(КлючОбъекта, ВариантыОтчета)
	СтрокаВнешнийОтчет = "ВнешнийОтчет.";
	ДлинаСтрокиВнешнийОтчет = СтрДлина(СтрокаВнешнийОтчет);
	Если Лев(КлючОбъекта, ДлинаСтрокиВнешнийОтчет) <> СтрокаВнешнийОтчет Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ВнешнийОтчет = ВнешниеОтчеты.Создать(Сред(КлючОбъекта, ДлинаСтрокиВнешнийОтчет + 1));
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru='Варианты отчетов. Подключение внешнего отчета';uk='Варіанти звітів. Підключення зовнішнього звіту'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Ошибка подключения внешнего отчета %1:';uk='Помилка підключення зовнішнього звіту %1:'"),
				КлючОбъекта
			) + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		Возврат;
	КонецПопытки;
	
	СхемаКД = ВнешнийОтчет.СхемаКомпоновкиДанных;
	Если ТипЗнч(СхемаКД) <> Тип("СхемаКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВариантНастроекКД Из СхемаКД.ВариантыНастроек Цикл
		Если ВариантыОтчета.Найти(ВариантНастроекКД.Имя, "КлючВариантаОтчета") = Неопределено Тогда
			СтрокаСписка = ВариантыОтчета.Добавить();
			СтрокаСписка.Наименование       = ВариантНастроекКД.Представление;
			СтрокаСписка.КлючВариантаОтчета = ВариантНастроекКД.Имя;
			СтрокаСписка.Ссылка             = Неопределено;
			СтрокаСписка.Автор              = Неопределено;
			СтрокаСписка.АвторПредставление = "";
			СтрокаСписка.Описание           = "";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИЗакрытьФорму()
	ТекущийВариант = Элементы.СписокВариантовОтчета.ТекущиеДанные;
	Если ТекущийВариант <> Неопределено Тогда 
		Закрыть(Новый ВыборНастроек(ТекущийВариант.КлючВариантаОтчета));
	Иначе
		Закрыть();
	КонецЕсли;
КонецПроцедуры
